Repository: DDDDV/KKok
Catalog: VocalSeparator/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ failed: %@
zh_hans: %@失败：%@

source: %@ · Listen and edit
zh_hans: %@ · 回放与调整

source: %@ · Original key
zh_hans: %@ · 原调

source: %lld points, tap to listen
zh_hans: %lld 分，回听

source: -Backing Track
zh_hans: -伴奏

source: -My Recording
zh_hans: -我的演唱

source: -Raw Recording
zh_hans: -原始录音

source: -Vocals
zh_hans: -人声

source: A recording is waiting to be saved
zh_hans: 有一段演唱等待保存

source: A recording is waiting to be saved · Review
zh_hans: 有一段演唱等待保存 · 前往处理

source: AAC (M4A) · Compact
zh_hans: AAC（M4A）· 小巧便携

source: ALAC (M4A) · Lossless Compression
zh_hans: ALAC（M4A）· 无损压缩

source: About
zh_hans: 关于

source: About Sing Freely
zh_hans: 关于随心唱

source: About and Licenses
zh_hans: 关于与许可

source: Add %@ to Favorites
zh_hans: 收藏%@

source: Add Lyrics
zh_hans: 添加歌词

source: Add a timed LRC file to follow the lyrics as you sing.
zh_hans: 添加带时间轴的 LRC，演唱时歌词随音乐流动。

source: Add lyrics
zh_hans: 可添加歌词

source: Add synced lyrics in song details
zh_hans: 可在歌曲详情中添加同步歌词

source: Add to Favorites
zh_hans: 收藏歌曲

source: Adjust during playback to hear changes immediately. Effects apply only to your vocals.
zh_hans: 播放时调整即可实时听到变化，音效仅作用于你的人声。

source: Agree and Continue
zh_hans: 同意并继续

source: All
zh_hans: 全部

source: All formats: WAV, MP3, AAC, and ALAC
zh_hans: 支持全部格式：WAV、MP3、AAC 和 ALAC

source: An unfinished recording was found. You can retry saving the performance.
zh_hans: 发现尚未完成保存的录音，可以重试生成演唱。

source: Analyzing the original vocal pitch
zh_hans: 正在分析原唱音高

source: Analyzing the reference melody. Your first performance may take a moment…
zh_hans: 正在分析参考旋律，首次演唱需要稍候…

source: Applies to backing tracks, vocals, performances, and raw recordings. Audio is converted only when exported. Your local originals and saved adjustments stay the same.
zh_hans: 应用于伴奏、人声、演唱和原始录音。导出时才转换格式，本机保存的原始音频和演唱调整不受影响。

source: Argmax Open Source Swift SDK
zh_hans: Argmax 开源 Swift SDK

source: Audio Export
zh_hans: 音频导出

source: Audio conversion stopped producing data.
zh_hans: 音频转换没有继续产生数据。

source: Audio decoding failed.
zh_hans: 音频解码失败。

source: Audio playback did not finish normally. Please try again.
zh_hans: 音频播放未正常结束，请重试。

source: Audio playback failed. Please try again.
zh_hans: 音频播放失败，请重试。

source: Audio plays through wireless headphones while the phone or an external microphone records your voice. Keep the phone close to your mouth when using its microphone.
zh_hans: 无线耳机播放，使用手机或外接麦克风收音；使用手机时请靠近嘴边。

source: Audio services restarted. Check your recording and try saving again.
zh_hans: 音频服务已重启，请检查并重试保存录音。

source: Backing Track
zh_hans: 伴奏

source: Backing Track Ready
zh_hans: 伴奏已就绪

source: Backing Tracks
zh_hans: 伴奏库

source: Backing track ready. You can start singing.
zh_hans: 伴奏已准备好，可以开始唱歌

source: Backing tracks: %lld · Synced lyrics ready: %lld
zh_hans: %lld 首伴奏 · %lld 首同步歌词就绪

source: Based on the original vocal melody, this score measures pitch and vocal coverage only for the recorded section. It does not assess tone, lyrics, or expression.
zh_hans: 以原唱参考旋律为准，仅评价本次录下部分的音高与演唱覆盖；不评价音色、歌词或情感。

source: Bathroom
zh_hans: 浴室

source: Cancel
zh_hans: 取消

source: Cancel Countdown
zh_hans: 取消倒计时

source: Cancel Separation
zh_hans: 取消分离

source: Canceled
zh_hans: 已取消

source: Canceling after the current audio chunk…
zh_hans: 正在取消；当前推理块结束后停止…

source: Canceling transcription after the current processing step…
zh_hans: 正在取消转写；当前推理步骤结束后停止…

source: Canceling transcription model preparation…
zh_hans: 正在取消转写模型准备…

source: Capture your first performance
zh_hans: 留下你的第一段歌声

source: Casual Mode
zh_hans: 休闲模式

source: Changes apply to your next performance. Turning scoring off hides the pitch track and stops new scores from being generated. Existing scores and scoring modes are kept.
zh_hans: 设置从下一次演唱生效。关闭后隐藏音准轨道，演唱不再生成分数。已有作品的分数和评分模式会保留。

source: Changes saved
zh_hans: 调整已保存

source: Changes were saved, but playback is unavailable: %@
zh_hans: 调整已保存，但暂时无法回放：%@

source: Checking purchase…
zh_hans: 正在检查购买状态…

source: Checking the local transcription model…
zh_hans: 正在检查本机转写模型…

source: Choose Audio Output
zh_hans: 选择音频输出设备

source: Choose a backing track and start singing. Your performance will be saved here automatically.
zh_hans: 选一首伴奏，进入沉浸式演唱。 录制完成后，作品会自动保存在这里。

source: Choose a random backing track from the current results and open the singing screen
zh_hans: 从当前筛选的伴奏中选择一首，进入演唱页面

source: Choose an audio file that iOS can decode
zh_hans: 请选择系统可解码的音频文件

source: Choose the Song for These Lyrics
zh_hans: 请确认歌词对应的歌曲

source: Choose where to start singing. Playback begins three seconds before the selected line.
zh_hans: 选择开唱位置，伴奏会从所选歌词前 3 秒开始播放。

source: Clear Search
zh_hans: 清除搜索

source: Close
zh_hans: 关闭

source: Concert Hall
zh_hans: 音乐厅

source: Copy Text
zh_hans: 复制文本

source: Creating temporary audio
zh_hans: 创建临时音频

source: Creating your backing track
zh_hans: 正在制作你的伴奏

source: Current microphone
zh_hans: 当前麦克风

source: Current score: %lld points
zh_hans: 当前得分 %lld 分

source: Decoding and converting to 44.1 kHz…
zh_hans: 正在解码并转换为 44.1 kHz…

source: Delete Backing Track and Vocals
zh_hans: 删除伴奏与人声

source: Delete Recording
zh_hans: 删除演唱

source: Delete Separated Tracks
zh_hans: 删除分离结果

source: Delete Song
zh_hans: 删除歌曲

source: Delete Song and Separated Tracks
zh_hans: 删除歌曲与分离结果

source: Delete separated tracks?
zh_hans: 删除分离结果？

source: Delete this recording?
zh_hans: 删除这次演唱？

source: Delete this song?
zh_hans: 删除这首歌曲？

source: Deletion Incomplete
zh_hans: 删除未完全完成

source: Demucs MIT License
zh_hans: Demucs MIT 许可证

source: Discard
zh_hans: 丢弃

source: Discard Changes
zh_hans: 放弃本次调整

source: Discard Recording
zh_hans: 丢弃录音

source: Discard the unsaved recording?
zh_hans: 丢弃未保存的录音？

source: Discarding these changes will keep the last saved version.
zh_hans: 放弃调整会保留上次保存的作品。

source: Done
zh_hans: 完成

source: Downloading transcription model (%lld%%)…
zh_hans: 正在下载转写模型（%lld%%）…

source: Drag the progress bar or tap a lyric to choose where to sing.
zh_hans: 拖动进度条或点选歌词，选择开唱位置。

source: EVERY VOICE IS WORTH KEEPING
zh_hans: 每一次开口，都值得留下

source: Embedded Lyrics
zh_hans: 内嵌歌词

source: Embedded lyrics available · No usable timing
zh_hans: 有内嵌歌词 · 无可用时间轴

source: Embedded lyrics found · Sync not enabled
zh_hans: 已发现内嵌歌词 · 未启用同步

source: Enable Pitch Scoring
zh_hans: 启用音准评分

source: Enable Vocal Transcription
zh_hans: 启用人声转写

source: Enable vocal transcription?
zh_hans: 启用人声转写？

source: End this performance?
zh_hans: 结束这次演唱？

source: Excellent pitch
zh_hans: 音准出色

source: Export %@
zh_hans: 导出%@

source: Export Audio
zh_hans: 导出音频

source: Export Backing Track
zh_hans: 导出伴奏

source: Export Format
zh_hans: 导出格式

source: Export Full Source and Build Instructions
zh_hans: 导出完整源码与构建说明

source: Export Raw Vocals Only
zh_hans: 仅导出原始录音

source: Export Recording
zh_hans: 导出演唱

source: Export Saved Mix (with Backing Track)
zh_hans: 导出已保存演唱（含伴奏）

source: Export Vocals
zh_hans: 导出人声

source: Export backing tracks, vocals, original tracks, and recordings
zh_hans: 导出伴奏、人声、原曲和演唱录音

source: Failed to delete recording: %@
zh_hans: 删除演唱失败：%@

source: Failed to save changes: %@
zh_hans: 保存调整失败：%@

source: Favorites
zh_hans: 收藏

source: Finish and Save
zh_hans: 结束并保存

source: Finish and Save Recording
zh_hans: 结束并保存演唱

source: First use requires a model download of about 602 MiB. Wi-Fi is recommended; keep the app open. Only the model download uses the internet. Audio and transcription stay on your device. Transcribed text does not include synced lyric timing.
zh_hans: 首次使用需下载约 602 MiB 的转写模型，建议连接 Wi-Fi 并保持应用在前台。只有模型下载会联网，音频与识别过程始终留在本机。转写文本不包含同步歌词时间轴。

source: Follow the melody and try again
zh_hans: 跟着旋律再试一次

source: Follow the notes and sing along
zh_hans: 跟着音符，唱出你的旋律

source: From Beginning
zh_hans: 从头开始

source: Full Performance
zh_hans: 整首演唱

source: Get ready to sing
zh_hans: 准备开唱

source: Go to Songs
zh_hans: 去歌曲库

source: HTDemucs Core ML Repository
zh_hans: HTDemucs Core ML 仓库

source: Hallway
zh_hans: 楼道

source: Headphones Connected
zh_hans: 耳机已连接

source: Headphones Recommended
zh_hans: 建议佩戴耳机

source: Headphones connected. You are ready to sing.
zh_hans: 耳机已连接，可以开始演唱。

source: Hear every detail of the original vocals
zh_hans: 听清原唱的每个细节

source: Import Failed
zh_hans: 导入失败

source: Import Songs
zh_hans: 导入歌曲

source: Import a song, optionally with its lyrics
zh_hans: 导入歌曲，可同时选择对应歌词

source: Import failed. You can still use %@.
zh_hans: 导入失败，仍可使用 %@

source: Import multiple audio files from Files, or add a song together with its LRC lyrics.
zh_hans: 从“文件”一次导入多首音频， 也可以为单首歌曲同时添加 LRC 歌词。

source: Imported. Tap to start separation.
zh_hans: 已导入，点击开始分离

source: Importing song
zh_hans: 正在导入歌曲

source: Importing songs and reading artwork and lyrics…
zh_hans: 正在导入歌曲并读取封面与歌词…

source: Importing…
zh_hans: 正在导入…

source: In Favorites
zh_hans: 已收藏

source: Incorrect input chunk length
zh_hans: 输入块长度错误

source: Invalid audio chunk settings.
zh_hans: 音频分块参数无效。

source: Just you and the music.
zh_hans: 此刻，只有音乐和你。

source: Keep Editing
zh_hans: 继续调整

source: Keep Every Performance
zh_hans: 留住每一次好声音

source: Keep Singing
zh_hans: 继续演唱

source: Keep practicing
zh_hans: 继续练习

source: Keep the phone close to your mouth.
zh_hans: 请将手机靠近嘴边。

source: LAME Website
zh_hans: LAME 项目网站

source: Leave Singing
zh_hans: 退出演唱

source: Less than one second of usable reference melody. Scoring is unavailable.
zh_hans: 有效参考旋律不足 1 秒，暂不能评分

source: License Scope
zh_hans: 许可范围

source: Lifetime Export
zh_hans: 永久导出

source: Lifetime Export Unlocked
zh_hans: 已永久解锁导出

source: Line by line
zh_hans: 逐行

source: Listen and Edit
zh_hans: 回放与调整

source: Listen and Edit Recording
zh_hans: 演唱回放与调整

source: Listen before separating
zh_hans: 分离前，先听一听

source: Loading price…
zh_hans: 正在加载价格…

source: Loading the separation model…
zh_hans: 正在载入分离模型…

source: Loading the transcription model…
zh_hans: 正在载入转写模型…

source: Lossless compression of 16- or 24-bit integer audio. Floating-point or higher-precision audio is converted to 24-bit integers. Choose WAV to preserve full floating-point precision.
zh_hans: 以 16／24 位整数无损压缩；浮点或更高精度音频会转换为 24 位整数。要保留完整浮点精度，请选择 WAV。

source: Lossy compression at 44.1 kHz: 256 kbps stereo or 128 kbps mono.
zh_hans: 有损压缩，双声道 256 kbps、单声道 128 kbps，44.1 kHz。

source: Lyrics Ready
zh_hans: 歌词就绪

source: Lyrics could not be fully read
zh_hans: 歌词读取未完成

source: Lyrics not checked
zh_hans: 歌词待检测

source: Lyrics updated. You can start singing.
zh_hans: 歌词已更新，可以开始唱歌

source: MP3 Encoding and Open Source License
zh_hans: MP3 编码与开源许可

source: MP3 encoding failed (%d). Try again or choose another format.
zh_hans: MP3 编码失败（%d），请重试或选择其他格式。

source: MP3 · Easy Sharing
zh_hans: MP3 · 通用分享

source: Make room for your first song
zh_hans: 让第一首歌住进来

source: Make the spotlight yours
zh_hans: 把主角的位置留给你

source: Microphone Level
zh_hans: 麦克风音量

source: Microphone access is required to record your singing. Allow microphone access in Settings.
zh_hans: 需要麦克风权限才能录制演唱，请在系统设置中允许访问麦克风。

source: Model Preparation Failed
zh_hans: 模型准备失败

source: More actions for %@
zh_hans: %@的更多操作

source: More actions for the recording of %@
zh_hans: %@演唱的更多操作

source: More forgiving of small pitch differences for relaxed singing. Missed notes still reduce your score.
zh_hans: 对轻微跑调更宽容，适合轻松跟唱；漏唱仍会扣分。

source: My Performances
zh_hans: 我的作品

source: My Recordings
zh_hans: 我的演唱

source: My Recordings · Includes backing track
zh_hans: 我的演唱 · 已包含伴奏

source: My Songs
zh_hans: 我的歌曲

source: My Vocal Volume
zh_hans: 我的人声音量

source: Name
zh_hans: 名称

source: Natural
zh_hans: 原声

source: No embedded lyrics found
zh_hans: 未发现内嵌歌词

source: No lifetime export purchase was found for this Apple Account.
zh_hans: 未找到此 Apple 账户的永久导出购买记录。

source: No matching backing tracks
zh_hans: 没有符合条件的伴奏

source: No rating yet
zh_hans: 暂无评分

source: No recordings found
zh_hans: 没有找到演唱

source: No reference note · Not scored
zh_hans: 无参考音符 · 暂不评分

source: No reliable reference notes
zh_hans: 无可靠参考音符

source: No score yet
zh_hans: 暂无分数

source: No songs here yet
zh_hans: 这里还没有歌曲

source: No synced lyrics? Sing your heart out.
zh_hans: 没有同步歌词，也可以尽情唱。

source: No usable text was recognized in the separated vocals.
zh_hans: 没有从分离后的人声中识别出可用文本。

source: No valid timestamps found. Import LRC lyrics or word-synced lyrics with [min:sec] / <min:sec> timestamps.
zh_hans: 未找到有效时间戳。请导入 LRC，或带 [分:秒] / <分:秒> 逐字时间戳的歌词。

source: Not Now
zh_hans: 暂不使用

source: Not Separated
zh_hans: 待分离

source: Not scored yet
zh_hans: 暂未评分

source: OK
zh_hans: 好

source: One purchase. Unlimited exports. No subscription or recurring fees.
zh_hans: 一次购买，无限导出。无需订阅，后续无需付费。

source: Open Microphone Settings
zh_hans: 打开麦克风设置

source: Open Source License
zh_hans: 开源许可

source: Open a performance in My Recordings to make further adjustments. Your raw recording is always kept.
zh_hans: 在“我的演唱”中打开作品，可继续调整。原始录音始终保留。

source: Opening input audio
zh_hans: 打开输入音频

source: Optimizing the transcription model for this device (first use may take longer)…
zh_hans: 正在为本机优化转写模型（首次可能较慢）…

source: Optional feature. On first use, a model of about 602 MiB will download after you confirm. You can then transcribe offline.
zh_hans: 可选功能。首次使用时会在您确认后下载约 602 MiB 模型，完成后可离线转写。

source: Optional: Vocal Transcription
zh_hans: 可选：人声转写

source: Original
zh_hans: 原唱

source: Original Track
zh_hans: 原曲

source: Original Vocals
zh_hans: 原唱人声

source: Overlap-add encountered a sample with zero weight.
zh_hans: 重叠拼接遇到零权重采样。

source: Pause
zh_hans: 暂停

source: Pause %@
zh_hans: 暂停%@

source: Pause Preview
zh_hans: 暂停试听

source: Performance Scoring
zh_hans: 演唱评分

source: Performance preparation was canceled. You can start again when you return.
zh_hans: 演唱准备已取消，返回后可重新开始。

source: Phone microphone
zh_hans: 手机麦克风

source: Phrase Scores · Tap to Listen
zh_hans: 逐句成绩 · 点击回听

source: Pitch
zh_hans: 音准

source: Pitch Results
zh_hans: 音准成绩

source: Pitch accuracy: %lld%%
zh_hans: 音准命中 %lld%%

source: Pitch analysis did not finish. Your recording has been kept.
zh_hans: 音高分析未完成，录音已保留。

source: Pitch analysis did not finish. Your recording was saved.
zh_hans: 音准分析未完成，录音已保存

source: Pitch score
zh_hans: 音准分

source: Pitch track, %@, %@
zh_hans: 音准轨道，%@，%@

source: Play %@
zh_hans: 播放%@

source: Play Preview
zh_hans: 播放试听

source: Playback Progress
zh_hans: 播放进度

source: Preparing %@…
zh_hans: 正在准备%@…

source: Preparing the microphone…
zh_hans: 正在准备麦克风…

source: Preparing the reference melody…
zh_hans: 正在生成参考旋律…

source: Preparing vocal transcription…
zh_hans: 正在准备人声转写…

source: Preparing…
zh_hans: 正在准备…

source: Preview
zh_hans: 试听

source: Preview Backing Track
zh_hans: 试听伴奏

source: Preview Original
zh_hans: 试听原曲

source: Preview failed: %@
zh_hans: 试听失败：%@

source: Privacy Policy
zh_hans: 隐私政策

source: Privacy and Terms
zh_hans: 隐私与条款

source: Processed on this device and added to Backing Tracks when finished. Keep the app open while processing.
zh_hans: 在本机处理，完成后自动加入伴奏库。 处理期间请保持应用在前台。

source: Processing incomplete
zh_hans: 处理未完成

source: Purchase awaiting approval. Export will unlock automatically when Apple confirms it.
zh_hans: 购买正在等待批准。Apple 确认后将自动解锁导出。

source: Reading artwork and lyrics…
zh_hans: 正在读取封面与歌词…

source: Reading input audio
zh_hans: 读取输入音频

source: Ready to Sing
zh_hans: 准备开唱

source: Recently Added
zh_hans: 最近添加

source: Record a Song
zh_hans: 录一首新歌

source: Recorded Excerpt
zh_hans: 已录片段

source: Recording Playback Progress
zh_hans: 演唱回放进度

source: Recording could not keep up with the input. The recorded portion has been kept.
zh_hans: 录音处理未能跟上输入，已保留录下的部分。

source: Recording is not ready. No score yet.
zh_hans: 录音尚未就绪，暂未评分

source: Recording processing failed: %@
zh_hans: 处理录音失败：%@

source: Recording with %@. %@Wireless headphones may still have a timing offset.
zh_hans: 正在用%@收音；%@无线耳机仍可能有同步偏差。

source: Recording · Make this moment yours
zh_hans: 正在录制 · 让歌声留在此刻

source: Recordings: %lld · Total time: %@
zh_hans: %lld 个作品 · 累计 %@

source: Reference melody analysis failed. This performance will be recorded without a score.
zh_hans: 参考旋律分析失败，本次仅保存录音

source: Reload Price
zh_hans: 重新加载价格

source: Remove
zh_hans: 移除

source: Remove %@ from Favorites
zh_hans: 取消收藏%@

source: Remove from Favorites
zh_hans: 取消收藏

source: Rename
zh_hans: 重命名

source: Rename Failed
zh_hans: 重命名失败

source: Rename Performance
zh_hans: 重命名作品

source: Rename Recording
zh_hans: 重命名演唱

source: Rename Song
zh_hans: 重命名歌曲

source: Rename failed: %@
zh_hans: 重命名失败：%@

source: Replace Lyrics
zh_hans: 更换歌词

source: Replay
zh_hans: 重听

source: Reset to Natural
zh_hans: 恢复原声

source: Restore Purchases
zh_hans: 恢复购买

source: Retry
zh_hans: 重试

source: Retry Saving
zh_hans: 重试保存

source: Retry Transcription
zh_hans: 重试转写

source: Rewind Ten Seconds
zh_hans: 后退十秒

source: Right on pitch. Keep it up!
zh_hans: 很准，保持住

source: Save
zh_hans: 保存

source: Save Changes
zh_hans: 保存调整

source: Save and Close
zh_hans: 保存并完成

source: Save these changes?
zh_hans: 保存这次调整？

source: Saved to My Recordings
zh_hans: 已保存到我的演唱

source: Saving changes…
zh_hans: 正在保存调整…

source: Saving recording…
zh_hans: 正在保存演唱…

source: Score
zh_hans: 得分

source: Scoring Mode
zh_hans: 评分模式

source: Scoring and saving recording…
zh_hans: 正在评分并保存演唱…

source: Scoring unavailable for this performance
zh_hans: 本次暂不评分

source: Search my recordings
zh_hans: 搜索我的演唱

source: Search separated songs
zh_hans: 搜索已分离的歌曲

source: Search your songs
zh_hans: 搜索你的歌曲

source: Select this line to start singing after a three-second countdown.
zh_hans: 选择这一句，倒计时 3 秒后开始演唱。

source: Separate Vocals and Backing Track
zh_hans: 分离人声与伴奏

source: Separate vocals and backing tracks in Songs. When ready, come here to sing.
zh_hans: 在歌曲库分离人声与伴奏， 完成后就能在这里进入演唱。

source: Separating chunk %lld of %lld
zh_hans: 正在分离第 %lld / %lld 段

source: Separation Failed
zh_hans: 分离失败

source: Separation and transcription complete
zh_hans: 分离与转写完成

source: Separation complete. Transcription canceled.
zh_hans: 分离完成，已取消转写

source: Separation complete. Transcription incomplete.
zh_hans: 分离完成，转写未完成

source: Settings
zh_hans: 设置

source: Share Text
zh_hans: 分享文本

source: Share and copy vocal transcriptions
zh_hans: 分享和复制人声转写文字

source: Show All Backing Tracks
zh_hans: 显示全部伴奏

source: Show All Recordings
zh_hans: 显示全部作品

source: Show All Songs
zh_hans: 显示全部歌曲

source: Sing %@
zh_hans: 演唱%@

source: Sing Along
zh_hans: 进入演唱

source: Sing Freely · Sing from the heart
zh_hans: 随心唱 · 从心开唱

source: Sing-Along Lyrics
zh_hans: 演唱歌词

source: Singing starts in %lld
zh_hans: 还有 %lld 秒开始演唱

source: Song
zh_hans: 歌曲

source: Song Details
zh_hans: 歌曲详情

source: Song ready. You can start separation.
zh_hans: 歌曲已就绪，可以开始分离

source: Songs
zh_hans: 歌曲库

source: Songs and recordings stay on this device
zh_hans: 歌曲与作品保存在本机

source: Songs you love. Sing them freely.
zh_hans: 喜欢的歌， 随心唱。

source: Songs: %lld · Backing tracks ready: %lld
zh_hans: %lld 首歌曲 · %lld 首伴奏已就绪

source: Sort %@, %@
zh_hans: %@排序，%@

source: Sort By
zh_hans: 排序方式

source: Sort by Name
zh_hans: 名称排序

source: Start Singing
zh_hans: 开始演唱

source: Start at %@ · 3-second countdown
zh_hans: 从 %@ 开唱 · 倒计时 3 秒

source: Start singing to see the notes
zh_hans: 开始演唱后显示音符轨道

source: Steady singing
zh_hans: 唱得很稳

source: Strict Mode
zh_hans: 严格模式

source: Surprise Me
zh_hans: 随机开唱

source: Synced lyrics ready
zh_hans: 同步歌词已就绪

source: THE STAGE IS YOURS
zh_hans: 把舞台留给你

source: Tap Save Changes when you are happy with the sound, then export the saved mix.
zh_hans: 满意后点击“保存调整”，即可导出这次效果。

source: Tap the heart next to a song to add it to Favorites, or try other filters.
zh_hans: 点歌曲旁的爱心即可收藏，或试试其他筛选条件。

source: Tap to cancel the countdown
zh_hans: 点击取消倒计时

source: Tap to finish · Saves automatically when the track ends
zh_hans: 点击结束 · 伴奏结束后自动保存

source: Tap to sing · Records your voice from the beginning
zh_hans: 点击开始演唱 · 从头录制你的声音

source: Terms of Service
zh_hans: 用户协议

source: The HTDemucs Core ML model was not found. Run Scripts/bootstrap.sh first.
zh_hans: 未找到 HTDemucs Core ML 模型。请先运行 Scripts/bootstrap.sh。

source: The app entered the background. Recording ended.
zh_hans: 应用已进入后台，录音已结束。

source: The app is in the background. Stopping and cleaning up…
zh_hans: 应用已进入后台，正在停止并清理…

source: The audio contains invalid samples and cannot be exported reliably.
zh_hans: 音频包含无效采样，无法可靠导出。

source: The audio device changed. The performance ended and the recorded portion was saved. Check your headphones before starting again.
zh_hans: 音频设备已切换，已结束演唱并保存录下的部分。请确认耳机连接后重新开始。

source: The audio device stopped working. An attempt was made to save the recorded portion.
zh_hans: 音频设备停止工作，已尝试保存录下的部分。

source: The audio engine stopped. The recorded portion has been kept.
zh_hans: 音频引擎已停止，已保留录下的部分。

source: The audio input is not Float32 [1,2,N]
zh_hans: audio 输入不是 Float32 [1,2,N]

source: The audio peaks exceed the ALAC integer range. Use WAV to preserve the full dynamic range.
zh_hans: 此音频的峰值超出 ALAC 整数音频范围。请使用 WAV 保留完整动态范围。

source: The HTDemucs model and pretrained weights, Demucs source code, and Core ML conversion code are provided under the MIT License. Conversion to Core ML for Apple platforms does not change the MIT License. Commercial use, modification, and redistribution are permitted under the MIT License, provided that the copyright and permission notices are retained.
zh_hans: HTDemucs 模型及预训练权重、Demucs 源代码和 Core ML 转换代码均采用 MIT 许可证。为 Apple 平台转换为 Core ML 格式不会改变其 MIT 许可证。遵守 MIT 许可证并保留版权声明和许可声明，即可用于商业用途、修改和再分发。

source: The downloaded transcription model failed verification and was not installed.
zh_hans: 下载的转写模型校验失败，已拒绝安装。

source: The downloaded transcription model is incompatible with this app.
zh_hans: 下载的转写模型版本与应用不兼容。

source: The exported audio has the wrong duration (expected %lld frames, got %lld).
zh_hans: 导出音频时长错误（期望 %lld 帧，实际 %lld 帧）。

source: The exported file failed its integrity check. Please try again.
zh_hans: 导出文件未通过完整性检查，请重试。

source: The imported original and saved recordings will be kept. You can separate the song again.
zh_hans: 保留导入的原曲和已保存的演唱，可重新分离。

source: The license could not be loaded. Please read the GNU LGPL on the LAME website.
zh_hans: 许可证暂时无法读取，请在 LAME 项目网站查看 GNU LGPL。

source: The lyrics contain too many lines or word timing markers. Please check the file.
zh_hans: 歌词行数或逐字标记过多，请检查文件内容。

source: The lyrics file is too large. Choose a text file no larger than 2 MB.
zh_hans: 歌词文件过大，请选择不超过 2 MB 的文本歌词。

source: The model's audio input does not match the expected (1, 2, 441000) Float32 format.
zh_hans: 模型的 audio 输入与预期的 (1, 2, 441000) Float32 不一致。

source: The model's sources output does not match the expected (1, 4, 2, 441000) Float16/Float32 format.
zh_hans: 模型的 sources 输出与预期的 (1, 4, 2, 441000) Float16/Float32 不一致。

source: The original vocals or backing track are missing, so this performance cannot be edited again. You can still play and export the saved version.
zh_hans: 这次演唱缺少原始人声或伴奏，无法再次调整。已有作品仍可回放和导出。

source: The overlap-add write range is invalid.
zh_hans: 重叠拼接的写入区间无效。

source: The performance has not been saved. Your raw recording has been kept. %@
zh_hans: 演唱尚未保存，原始录音已保留。%@

source: The purchase is unavailable. Please check your connection and try again.
zh_hans: 暂时无法购买，请检查网络连接后重试。

source: The recording contains audio data that cannot be processed.
zh_hans: 录音中包含无法处理的音频数据。

source: The recording is too short. Sing for a little longer before finishing.
zh_hans: 录音太短，请至少演唱片刻后再结束。

source: The selected audio has no content to process.
zh_hans: 所选音频没有可处理的内容。

source: The separated audio chunk does not match the timeline.
zh_hans: 分离结果块与时间轴不匹配。

source: The song library is unavailable
zh_hans: 歌曲库暂时无法打开

source: The sources output is not Float16/Float32 [1,4,2,N]
zh_hans: sources 输出不是 Float16/Float32 [1,4,2,N]

source: The system could not create a 44.1 kHz stereo converter.
zh_hans: 系统无法创建 44.1 kHz 双声道转换器。

source: The system interrupted your performance. Recording ended.
zh_hans: 演唱被系统中断，录音已结束。
